## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| add    | `aws_s3_object.platform_support_freshdesk`              |
| delete | `aws_glue_trigger.platform_support_freshdesk`           |
|        | `aws_s3_object.platform_support_freshdesk_job`          |
|        | `aws_s3_object.platform_support_freshdesk_requirements` |
| update | `aws_glue_job.platform_support_freshdesk`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_glue_job.platform_support_freshdesk will be updated in-place
  ~ resource "aws_glue_job" "platform_support_freshdesk" {
      ~ default_arguments         = {
          ~ "--additional-python-modules"        = "s3://cds-data-lake-glue-production/platform/support/freshdesk/requirements.txt" -> "awswrangler==3.11.0"
          - "--enable-auto-scaling"              = "true" -> null
          - "--enable-job-insights"              = "true" -> null
          - "--job-language"                     = "python" -> null
          - "--python-modules-installer-option"  = "-r" -> null
            # (13 unchanged elements hidden)
        }
      - execution_class           = "FLEX" -> null
        id                        = "Platform / Support / Freshdesk"
        name                      = "Platform / Support / Freshdesk"
        tags                      = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_trigger.platform_support_freshdesk will be destroyed
  # (because aws_glue_trigger.platform_support_freshdesk is not in configuration)
  - resource "aws_glue_trigger" "platform_support_freshdesk" {
      - arn           = "arn:aws:glue:ca-central-1:739275439843:trigger/Platform / Support / Freshdesk" -> null
      - enabled       = true -> null
      - id            = "Platform / Support / Freshdesk" -> null
      - name          = "Platform / Support / Freshdesk" -> null
      - schedule      = "cron(30 5 * * ? *)" -> null
      - state         = "ACTIVATED" -> null
      - tags          = {} -> null
      - tags_all      = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - type          = "SCHEDULED" -> null
        # (2 unchanged attributes hidden)

      - actions {
          - arguments              = {} -> null
          - job_name               = "Platform / Support / Freshdesk" -> null
          - timeout                = 0 -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_s3_object.platform_support_freshdesk will be created
  + resource "aws_s3_object" "platform_support_freshdesk" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "69bb3310105ed544b8c572547aaae245"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/support/freshdesk/process_tickets.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/support/freshdesk/scripts/process_tickets.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.platform_support_freshdesk_job will be destroyed
  # (because aws_s3_object.platform_support_freshdesk_job is not in configuration)
  - resource "aws_s3_object" "platform_support_freshdesk_job" {
      - arn                           = "arn:aws:s3:::cds-data-lake-glue-production/platform/support/freshdesk/process_tickets.py" -> null
      - bucket                        = "cds-data-lake-glue-production" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream; charset=UTF-8" -> null
      - etag                          = "8e416e2698f191c2a9c7303c8e398af9" -> null
      - force_destroy                 = false -> null
      - id                            = "platform/support/freshdesk/process_tickets.py" -> null
      - key                           = "platform/support/freshdesk/process_tickets.py" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./etl/platform/support/freshdesk/scripts/process_tickets.py" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - version_id                    = "LvIK8oVXgaJY1BqgeosRDJlDAKNgwKf4" -> null
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.platform_support_freshdesk_requirements will be destroyed
  # (because aws_s3_object.platform_support_freshdesk_requirements is not in configuration)
  - resource "aws_s3_object" "platform_support_freshdesk_requirements" {
      - arn                           = "arn:aws:s3:::cds-data-lake-glue-production/platform/support/freshdesk/requirements.txt" -> null
      - bucket                        = "cds-data-lake-glue-production" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "94d18cc6f3c8e50a1e3a988e78e6a849" -> null
      - force_destroy                 = false -> null
      - id                            = "platform/support/freshdesk/requirements.txt" -> null
      - key                           = "platform/support/freshdesk/requirements.txt" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./etl/platform/support/freshdesk/scripts/requirements.txt" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - version_id                    = "ZFtmsKzmAWsxEAhi1SpSvgQj7SdB3t_V" -> null
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.platform_support_freshdesk"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
